---
title: PaperSizeSet
classe: Autodesk.Revit.DB.PaperSizeSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PaperSizeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `paperSizeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `paperSizeSet.Size` | Int32 |
| `Void Clear()` | `paperSizeSet.Clear()` | Void |
| `Boolean Contains(PaperSize)` | `paperSizeSet.Contains(item)` | Boolean |
| `Int32 Erase(PaperSize)` | `paperSizeSet.Erase(item)` | Int32 |
| `PaperSizeSetIterator ForwardIterator()` | `paperSizeSet.ForwardIterator()` | PaperSizeSetIterator |
| `IEnumerator GetEnumerator()` | `paperSizeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(PaperSize)` | `paperSizeSet.Insert(item)` | Boolean |
| `PaperSizeSetIterator ReverseIterator()` | `paperSizeSet.ReverseIterator()` | PaperSizeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```